<?php
$year=$_POST["inp"];

echo $year," ";

if ($year/4&&$year%4==0) {
    echo "год то високосный т.к делится на 4";
}
else{
    
    if ($year/100&&$year%100==0) {
        echo "год то не високосный т.к делится на 100";
    }
    else {
        if ($year/400&&$year%400==0) {
            echo "год то високосный т.к делится на 400";
        }
        else {
            echo "год то не високосный";
        }
    }
}



// if ($year/400&&$year%400==0) {
//     echo "год то високосный";
// }
// else{
//     // echo "не високосный";
//     if ($year/100&&$year%100==0) {
//         echo "год то не високосный";
        
//     }
//     else {
//         if ($year/4&&$year%4==0) {
//             echo "год то високосный";
//         }
//         else{
//             echo "год то не високосный";
//         }
//     }
// }






  

?>
